Repository: debian-janitor/tex-common
Catalog: debian/po/*.po
Languages: it, ja, sv, tr

source: Manage the permissions of the TeX font cache with debconf?
tr: TeX yazý tipi önbelleði yetkileri debconf ile yönetilsin mi?

source: A TeX system may have to generate new font data (pixel data, metric, sources) on the fly. These files can be saved into the TeX font cache in /var/cache/fonts and later reused.
tr: Bir TeX sistemi (benek verileri, ölçüler, kaynaklar gibi) yazýtipi verilerini anlýk oluþturabilmelidir. Bu dosyalar /var/cache/fonts altýndaki TeX yazýtipi önbelleðine kaydedilir ve daha sonra yeniden kullanýlýr.

source: If you accept, you can specify a group name and *all* directories under /var/cache/fonts will get ownership root:<groupname> and permission bits 3775 (i.e. writable for the group <groupname>, sticky and setgid bit set). Accordingly, the ls-R index file will be owned and writable by that group.
tr: Eðer kabul ederseniz /var/cache/fonts altýndaki tüm dizinlerin sahiplikleri belirlediðiniz bir grup adýna göre root:<grupadý> ve izinleri de 3775 (yani <grupadý> grubu tarafýndan yazýlabilir ve, yapýþkan ["sticky"] ve "setgid" bayraklarý etkinleþtirilmiþ) olacaktýr. Buna göre, ls-R dosyasýnýn sahibi bu grup olacak ve bu grup tarafýndan yazýlabilecektir.

source: If you accept, font generation will only work for users that have been added to the group you chose - this has to be done manually by you!
tr: E?er onaylarsan?z, yaz? tipi olu?turulmas?, sadece seçti?iniz gruptaki -bunu kendiniz elinizle yapmal?s?n?z - kullan?c?lar için çal??t?rlabilecektir.

source: The default is not to manage permissions with debconf, but this is just because this is required for building other Debian packages. In almost every other setup, like desktop machines or multi-user servers, accepting this (and adding users to the group) is strongly recommended!
tr: Diðer Debian paketlerinin de oluþturulabilmesi için, öntanýmlý olarak izinler debconf ile yönetilmez, ancak bu sadece di?er Debian paketlerini olu?utrabilmek için böyle ayarlanm??t?r. Masaüstü bilgisayarlar veya çok kullanýcýlý sunucular gibi diðer tüm kurulumlarda bunu kabul etmeniz (ve kullan?c?lar? gruba eklemeniz) þiddetle önerilir!

source: Group that should own the TeX font cache
tr: TeX önbelleðinin sahibi olan grup

source: You can choose a specific group which will own all directories under and including the TeX font cache /var/cache/fonts. These directories will get permission 3775.
tr: TeX yazýtipi önbelleðini de içeren /var/cache/fonts dizini sahipliði için belli bir grup belirleyebilirsiniz. Bu dizinler 3775 izinlerini alacaktýr.

source: Note that on a Debian system, nobody is member of the "users" group by default, so local users have to be added manually!
tr: Debian'da nobody kullan?c?s?n?n öntan?ml? olarak, "users" grubuna dahil oldu?unu, bu yüzden yerel kullan?c?l?lar?n elle eklenmesi gerekti?ini unutmay?n.

source: Change of name of files in /etc/texmf/texmf.d/
it: Modifica del nome dei file in /etc/texmf/texmf.d/
ja: /etc/texmf/texmf.d/ にあるファイル名の変更
sv: Ändrade namn på filer i /etc/texmf/texmf.d/
tr: /etc/texmf/texmf.d/ altýndaki dosya adý deðiþiklikleri

source: texmf.cnf has previously been generated by update-texmf from all files in /etc/texmf/texmf.d/. Now update-texmf is changed and only reads files with extension '.cnf'.
ja: texmf.cnf は以前、/etc/texmf/texmf.d/ にあるすべてのファイルから update-texmf によって生成されていました。現在、update-texmf は拡張子 '.cnf' を持つファイルのみを読み込むように変更されています。
sv: texmf.cnf har tidigare genererats av update-texmf från alla filer i /etc/texmf/texmf.d/. Nu är update-texmf ändrad så att den endast läser filer med filändelsen ".cnf".
tr: texmf.cnf, update-texmf komutu ile /etc/texmf/texmf.d/ içindeki tüm dosyalardan oluþturuldu. Þimdi update-texmf deðiþtirildi ve þu anda sadece '.cnf' uzantýlý dosyalarý okuyor.

source: So if you had any private file in /etc/texmf/texmf.d/, then you should add '.cnf' to its name; for example, 22mymacro => 22mymacro.cnf.
ja: そのため、もし /etc/texmf/texmf.d/ に独自のファイルを持っているのであれば、'.cnf' をその名前に追加すべきです (たとえば、22mymacro を 22mymacro.cnf とします)。
sv: Om du haft några privata filer i /etc/texmf/texmf.d/ bör du lägga till ".cnf" till dess namn, till exempel 22mymacro => 22mymacro.cnf.
tr: Eðer /etc/texmf/texmf.d/ içinde özel bir dosyanýz varsa, bunun ismine '.cnf' uzantýsýný ekleyin; örneðin, 22mymacro => 22mymacro.cnf .

source: Essential entry missing in ${filename}
ja: ${filename} に必須エントリがありません
sv: Nödvändig post saknas i ${filename}
tr: ${filename} dosyasýnda gerekli bir girdi eksik

source: An essential entry is missing in ${filename}:
ja: ${filename} に必須エントリがありません:
sv: En nödvändig post saknas i ${filename}.
tr: ${filename} dosyasýnda gerekli bir girdi eksik:

source: No setting of ${variable}.
ja: ${variable} が設定されていません。
sv: Ingen inställning för ${variable}.
tr: ${variable} için ayar yok.

source: Essential entry wrong in ${filename}
ja: ${filename} の必須エントリが誤っています
sv: Nödvändig post felaktig i ${filename}
tr: ${filename} dosyasýndaki gerekli bir girdi yanlýþ

source: An essential entry is wrong in ${filename}: ${variable} does not contain
ja: ${filename} の必須エントリが誤っています: ${variable} を含んでいません
sv: En nödvändig post är felaktig i ${filename}: ${variable} innehåller inte
tr: ${filename} dosyasýnda gerekli bir girdi yanlýþ: ${variable} içermiyor

source: TeX will not work without it, you need to fix your configuration files. The version of ${filename} that is provided by the package should be available as ${filename}.dpkg-dist.
ja: 設定ファイルを修正する必要があり、TeX はそれなしには動作しません。パッケージによって提供されるバージョンの ${filename} は、${filename}.dpkg-dist として利用できます。
sv: TeX kommer inte att fungera utan den, du behöver rätta till dina konfigurationsfiler. Versionen av ${filename} som ges av paketet bör finnas tillgänglig som ${filename}.dpkg-dist.
tr: TeX bu olmadan çalýþamaz. Yapýlandýrma dosyalarýnýzý düzeltmeniz gerekiyor. Paket tarafýndan saðlanan ${filename} dosyasýna ${filename}.dpkg-dist adýyla ulaþabilirsiniz.

source: Exiting.
ja: 終了しています。
sv: Avslutar.
tr: Çýkýlýyor.

source: Select the ls-R file which should be managed by debconf
it: Scegliere quali file ls-R devono essere gestiti con debconf

source: There are many files installed in a typical TeX system. To speed up the search of these files a list of available files is stored in a file called ls-R. There are four different locations for TeX files on a Debian system: - main: usually /usr/share/texmf, contains only files installed by debian packages. - local: usually /usr/local/share/texmf, contains local additions - var: usually /var/lib/texmf, contains generated files from the TeX system like format files. - cache: usually /var/cache/fonts, contains generated fonts. You can select from these four locations those whose ls-R file should be managed by debconf.
it: Un tipico sistema TeX comporta l'installazione di parecchi file. Per velocizzare la ricerca di questi file viene memorizzato nei file ls-R un elenco dei file disponibili. In un sistema Debian i file TeX possono essere memorizzati in quattro possibili posizioni: - main: solitamente /usr/share/texmf, contiene i file installati tramite dei pacchetti Debian. - local: solitamente /usr/local/share/texmf, contiene le aggiunte locali. - var: solitamente /var/lib/texmfm, contiene i file creati dal sistema TeX, per esempio i file format. - cache: solitamente /var/cache/fonts, contiene i file per i font. Si può scegliere quali file ls-R fra quelli in queste quattro posizioni devono essere gestiti con debconf.

source: We suggest selecting cache and local (these are the defaults) and allowing a selected user group to modify these ls-R files out of the following reasons:
it: Si suggerisce di scegliere «cache» e «local» (questi sono i valori predefiniti) e di consentire al gruppo di utenti scelto di modificare i file ls-R per i seguenti motivi:

source: A lot of font files have to be generated before they can be used by xdvi, dvips etc. These files are stored in /var/cache/fonts, so that they do not need to be regenerated every time.
it: Molti dei file per i font devono essere generati prima che sia possibile usarli con xdvi, dvips, ecc. Questi file sono memorizzati in /var/cache/fonts in modo che non sia necessario rigenerarli ogni volta.

source: Some users may have the right to add files to the local texmf tree, so they should also be allowed to change the ls-R file.
it: Alcuni utenti potrebbero avere i permessi per aggiungere dei file nell'albero texmf locale, a questi utenti si dovrebbe consentire la modifica dei file ls-R.

source: Accepting this option will allow you to easily manage the permissions of those ls-R files using debconf. Otherwise you will have to manually ensure that they get useful but safe permissions.
it: Se si accetta questa opzione sarà possibile gestire facilmente i permessi dei file ls-R usando debconf, altrimenti si dovrà assicurare manualmente che abbiano permessi utili ma anche sicuri.

source: Which group should own the ls-R files?
it: A quale gruppo devono appartenere i file ls-R?

source: Modification of ls-R files can be restricted to the members of one group which owns them. To take advantage of this, add the users to the group of your choice, and enter that group name here. The default group, 'users', is appropriate for most systems.
it: La modifica dei file ls-R può essere ristretta ai membri del gruppo che li possiede. Per trarre vantaggio da questa possibilità aggiungere gli utenti al gruppo scelto e inserire il nome del gruppo. Il gruppo predefinito, «users», è adatto per la maggior parte dei sistemi.

source: Allow group members to modify ls-R files?
it: Permettere ai membri del gruppo di modificare i file ls-R?

source: Accepting this option will allow members of the owning group to modify the ls-R files.
it: Se si accetta questa opzione si permette a tutti i membri del gruppo proprietario di modificare i file ls-R.

source: Allow all users to modify ls-R files?
it: Permettere a tutti gli utenti la modifica dei file ls-R?

source: Accepting this option will allow all users to modify ls-R files. This is generally not a good idea for security reasons; you should instead restrict such access to members of one group.
it: Se si accetta questa opzione sarà permesso a tutti gli utenti di modificare i file ls-R. Di solito questa non è una buona idea per ragioni di sicurezza; si dovrebbe restringere l'accesso ai soli membri di un gruppo.

source: texmf.cnf has previously been generated by update-texmf from all files in /etc/texmf/texmf.d/. Now update-texmf is changed and only reads files with extension '.cnf'
it: texmf.cnf è stato creato precedentemente da update-texmf usando tutti i file in /etc/texmf/texmf.d/. Adesso update-texmf legge solo i file con estensione «.cnf».

source: So if you had any private file in /etc/texmf/texmf.d/, then you should add '.cnf' to its name; for example, 22mymacro => 22mymacro.cnf
it: Se sono stati aggiunti dei file personali in /etc/texmf/texmf.d/ si dovrebbe aggiungere «.cnf» al loro nome (p.e. 22miamacro diventa 22miamacro.cnf).
